# SolidCurveIntersectionOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidCurveIntersectionOptions Constructor
SolidCurveIntersectionOptions Class See Also
---
Constructs a new SolidCurveIntersectionMode with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SolidCurveIntersectionOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SolidCurveIntersectionOptions()
```

# See Also
SolidCurveIntersectionOptions Class
Autodesk.Revit.DB Namespace